- Pandas is a Python library for working with tabular data.
- Pandas is used to analyze, clean, explore, and manipulate tabular data.
- Pandas allows us to analyze big data and make conclusions based on statistical
theories

In [2]:
import pandas as pd

pd.__version__

'2.2.3'

1_Pandas Dataframe:  A_data_structure_for_tabular_data

In [13]:
health_data_table = {
    "height": [5.5, 5.5, 'A', 5.8],
    "weight": [57, 62, 72, 75],
    "bmi": [19.3, 12.7, 20.3, None],
    'smoker': ['Yes', 'No', None, 'Yes'],
}

health_data_frame = pd.DataFrame(
    health_data_table
)

print(type(health_data_frame))

# Displays_the_first_few_rows_of _a_DataFrame
health_data_frame.head()

<class 'pandas.core.frame.DataFrame'>

  height  weight   bmi smoker
0    5.5      57  19.3    Yes
1    5.5      62  12.7     No
2      A      72  20.3   None
3    5.8      75   NaN    Yes

In [14]:
# Display_the_last_row_of_the_DataFrame

health_data_frame.tail(1)

  height  weight  bmi smoker
3    5.8      75  NaN    Yes

In [15]:
# Display_a_summary_of_the_DataFrame

health_data_frame.describe()

         weight        bmi
count   4.00000   3.000000
mean   66.50000  17.433333
std     8.42615   4.129568
min    57.00000  12.700000
25%    60.75000  16.000000
50%    67.00000  19.300000
75%    72.75000  19.800000
max    75.00000  20.300000

In [16]:
# Show_DataFrame_as_NumPy_array_and_its-type

health_data_np_array = health_data_frame.values

print(health_data_np_array)
print(type(health_data_np_array))

[[5.5 57 19.3 'Yes']
 [5.5 62 12.7 'No']
 ['A' 72 20.3 None]
 [5.8 75 nan 'Yes']]
<class 'numpy.ndarray'>

In [17]:
# Display_DataFrame_column_names_and_their_type

print(health_data_frame.columns)
print(type(health_data_frame.columns))

Index(['height', 'weight', 'bmi', 'smoker'], dtype='object')
<class 'pandas.core.indexes.base.Index'>

In [18]:
# Rename_DataFrame_columns_and_display_the_first_few_rows

health_data_frame.columns = [
    "Height (Feet)", "Weight (Kg)", "BMI", "Is Smoker"
]

health_data_frame.head()

  Height (Feet)  Weight (Kg)   BMI Is Smoker
0           5.5           57  19.3       Yes
1           5.5           62  12.7        No
2             A           72  20.3      None
3           5.8           75   NaN       Yes

2_to_csv: saves the data frame into a comma separated text file.
to_excel: saves the data frame into a excel file.
to_sql: saves the data frame as a SQL table.

In [22]:
# Save_the_DataFrame_to_a_CSV_file

health_data_frame.to_csv(
    
    "C:\\Users\\mrmdh\OneDrive\\Desktop\\my_csv_file\\my_saved_df.csv",
    index=False,
)

3_Read_Data_frame_from_a_file 

There are number of file formats:
1. Text file (.txt)
2. Comma Separated Value file (.csv)
3. JSON File (.json)
4. Excel File (.xls)

In [30]:
df = pd.read_csv(
    
    "C:\\Users\\mrmdh\\OneDrive\\Desktop\\data_science\\pandas_2\\class-19-homelessness.csv"

)

print(type(df))
df.head()

<class 'pandas.core.frame.DataFrame'>

,Unnamed: 0,region,state,individuals,family_members,state_pop
0,0,East South Central,Alabama,2570.0,864.0,4887681
1,1,Pacific,Alaska,1434.0,582.0,735139
2,2,Mountain,Arizona,7259.0,2606.0,7158024
3,3,West South Central,Arkansas,2280.0,432.0,3009733
4,4,Pacific,California,109008.0,20964.0,39461588

In [31]:
df.columns

Index(['Unnamed: 0', 'region', 'state', 'individuals', 'family_members',
       'state_pop'],
      dtype='object')

In [35]:
# Sort_the_DataFrame_by_multiple_columns_and_display_the_top_50_rows

sorted_df_by_multi_cols = df.sort_values(
    by=['region', 'state'],
    ascending=[True, False]
) 

sorted_df_by_multi_cols.head(5)

,Unnamed: 0,region,state,individuals,family_members,state_pop
49,49,East North Central,Wisconsin,2740.0,2167.0,5807406
35,35,East North Central,Ohio,6929.0,3320.0,11676341
22,22,East North Central,Michigan,5209.0,3142.0,9984072
14,14,East North Central,Indiana,3776.0,1482.0,6695497
13,13,East North Central,Illinois,6752.0,3891.0,12723071

In [40]:
individuals = df['individuals']
print(type(individuals))
# print(individuals)

print(individuals.head(5))

<class 'pandas.core.series.Series'>
0      2570.0
1      1434.0
2      7259.0
3      2280.0
4    109008.0
Name: individuals, dtype: float64

In [41]:
new_df = df[['region', 'family_members'] ]
new_df.head()

               region  family_members
0  East South Central           864.0
1             Pacific           582.0
2            Mountain          2606.0
3  West South Central           432.0
4             Pacific         20964.0

In [42]:
mask = df['region'] == 'Mountain'
df_mountain = df[ mask ]
df_mountain.head()

    Unnamed: 0    region     state  individuals  family_members  state_pop
2            2  Mountain   Arizona       7259.0          2606.0    7158024
5            5  Mountain  Colorado       7607.0          3250.0    5691287
12          12  Mountain     Idaho       1297.0           715.0    1750536
26          26  Mountain   Montana        983.0           422.0    1060665
28          28  Mountain    Nevada       7058.0           486.0    3027341

In [43]:
df_gt_10k = df[ df['individuals'] > 10000 ]
df_gt_10k.head()

,Unnamed: 0,region,state,individuals,family_members,state_pop
4,4,Pacific,California,109008.0,20964.0,39461588
9,9,South Atlantic,Florida,21443.0,9587.0,21244317
32,32,Mid-Atlantic,New York,39827.0,52070.0,19530351
37,37,Pacific,Oregon,11139.0,3337.0,4181886
43,43,West South Central,Texas,19199.0,6111.0,28628666

In [44]:
is_family_lt_1k_mask = df['family_members'] < 10000
is_region_pacific_mask = df['region'] == 'Pacific'

new_df = df[ is_family_lt_1k_mask & is_region_pacific_mask ]
new_df.head()

    Unnamed: 0   region       state  individuals  family_members  state_pop
1            1  Pacific      Alaska       1434.0           582.0     735139
11          11  Pacific      Hawaii       4131.0          2399.0    1420593
37          37  Pacific      Oregon      11139.0          3337.0    4181886
47          47  Pacific  Washington      16424.0          5880.0    7523869

In [45]:
df['total_population'] = df['individuals'] + df['state_pop']
df.head()

,Unnamed: 0,region,state,individuals,family_members,state_pop,total_population
0,0,East South Central,Alabama,2570.0,864.0,4887681,4890251.0
1,1,Pacific,Alaska,1434.0,582.0,735139,736573.0
2,2,Mountain,Arizona,7259.0,2606.0,7158024,7165283.0
3,3,West South Central,Arkansas,2280.0,432.0,3009733,3012013.0
4,4,Pacific,California,109008.0,20964.0,39461588,39570596.0

4_Query 
- Query must be written in the double quote format
- Inside the double quote we can use single for string

In [46]:
new_df = df.query(
    "region == 'Pacific' and family_members < 10000"
)

new_df.head()

,Unnamed: 0,region,state,individuals,family_members,state_pop,total_population
1,1,Pacific,Alaska,1434.0,582.0,735139,736573.0
11,11,Pacific,Hawaii,4131.0,2399.0,1420593,1424724.0
37,37,Pacific,Oregon,11139.0,3337.0,4181886,4193025.0
47,47,Pacific,Washington,16424.0,5880.0,7523869,7540293.0

- Data in our daily life
1. Text: I eat rice.
2. Tabular: Contains any table
3. Image: Images of cats, dogs, etc.
4. Video: Videos of cats, dogs, etc.
5. Audio: Speech

- Fundamental idea of any data processing for analysis
1. Step 1. Clean up the data (No missing values, No duplicate values)
2. Step 2. Convert all the data into same types
3. Step 3. Remove bias to ensure fair presence of each category of examples
4. Step 4. Balance the impacts of features (No feature should dominate other features)

Create_file_paths_using_os.path_and_display_directory_locations

In [4]:
import os

root_dir =  "C:\\Users\\mrmdh\\OneDrive\\Desktop\\data_science\\pandas_2"
data_dir = os.path.join(root_dir, 'data')
dataset_path = os.path.join(data_dir, 'class-19-sales_subset.csv')

# print("root_dir = ", root_dir)
# print("data_dir = ", data_dir)
# print("dataset_path = ", dataset_path)

In [5]:
# Read_the_dataset

sales = pd.read_csv(dataset_path)
sales.head()

,Unnamed: 0,store,type,department,date,weekly_sales,is_holiday,temperature_c,fuel_price_usd_per_l,unemployment
0,0,1,A,1,2010-02-05,24924.50,False,5.727778,0.679451,8.106
1,1,1,A,1,2010-03-05,21827.90,False,8.055556,0.693452,8.106
2,2,1,A,1,2010-04-02,57258.43,False,16.816667,0.718284,7.808
3,3,1,A,1,2010-05-07,17413.94,False,22.527778,0.748928,7.808
4,4,1,A,1,2010-06-04,17558.09,False,27.050000,0.714586,7.808

In [25]:
# Drop_a_column(s)_from_a_dataframe 

sales = sales.drop(columns=['Unnamed: 0'])
sales.head()

,store,type,department,date,weekly_sales,is_holiday,temperature_c,fuel_price_usd_per_l,unemployment
0,1,A,1,2010-02-05,24924.50,False,5.727778,0.679451,8.106
1,1,A,1,2010-03-05,21827.90,False,8.055556,0.693452,8.106
2,1,A,1,2010-04-02,57258.43,False,16.816667,0.718284,7.808
3,1,A,1,2010-05-07,17413.94,False,22.527778,0.748928,7.808
4,1,A,1,2010-06-04,17558.09,False,27.050000,0.714586,7.808

In [26]:
sales.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10774 entries, 0 to 10773
Data columns (total 9 columns):
 #   Column                Non-Null Count  Dtype
---  ------                --------------  -----
 0   store                 10774 non-null  int64
 1   type                  10774 non-null  object
 2   department            10774 non-null  int64
 3   date                  10774 non-null  object
 4   weekly_sales          10774 non-null  float64
 5   is_holiday            10774 non-null  bool
 6   temperature_c         10774 non-null  float64
 7   fuel_price_usd_per_l  10774 non-null  float64
 8   unemployment          10774 non-null  float64
dtypes: bool(1), float64(4), int64(2), object(2)
memory usage: 684.0+ KB

In [30]:
 # mean
average_sales = sales['weekly_sales'].mean()
print(average_sales)

import numpy as np
average_sales = np.mean(sales['weekly_sales'])
print(average_sales) # numpy panda same

23843.95014850566
23843.95014850566

In [29]:
print("mean", sales["weekly_sales"].mean())
print("median", sales["weekly_sales"].median())
print("max", sales["date"].max())
print("min", sales["date"].min())
print("sum", sales['weekly_sales'].sum())

mean 23843.95014850566
median 12049.064999999999
max 2012-10-26
min 2010-02-05
sum 256894718.89999998

In [31]:
# - cumsum → এখন পর্যন্ত বিক্রির যোগফল
# - cummax → এখন পর্যন্ত বিক্রির সর্বোচ্চ মান
# - cummin → এখন পর্যন্ত বিক্রির সর্বনিম্ন মান


# Cumulative_sum (accumulated_sum)

sales["weekly_sales"].cumsum()

0        2.492450e+04
1        4.675240e+04
2        1.040108e+05
3        1.214248e+05
4        1.389829e+05
             ...
10769    2.568930e+08
10770    2.568934e+08
10771    2.568938e+08
10772    2.568938e+08
10773    2.568947e+08
Name: weekly_sales, Length: 10774, dtype: float64

In [32]:
# cumulative_maximum

sales["weekly_sales"].cummax()

0         24924.50
1         24924.50
2         57258.43
3         57258.43
4         57258.43
           ...
10769    293966.05
10770    293966.05
10771    293966.05
10772    293966.05
10773    293966.05
Name: weekly_sales, Length: 10774, dtype: float64

In [33]:
# cumulative_minimum

sales["weekly_sales"].cummin()

0        24924.50
1        21827.90
2        21827.90
3        17413.94
4        17413.94
           ...
10769    -1098.00
10770    -1098.00
10771    -1098.00
10772    -1098.00
10773    -1098.00
Name: weekly_sales, Length: 10774, dtype: float64

In [6]:
# mean

sales[ ["weekly_sales", "fuel_price_usd_per_l"] ].mean()

weekly_sales            23843.950149
fuel_price_usd_per_l        0.749746
dtype: float64

- Apply_custom_methods_on_pandas_dataframe

- weekly_sales = [2 3 1 4 2]
mean = 2.4
- standard_x = (x - mean)/std

In [10]:
import pandas as np

weekly_sales = np.array([2, 3, 1, 4, 2])
print(weekly_sales.mean(), weekly_sales.std())

2.4 1.140175425099138

In [13]:
# zero_mean_and_unit_variance

def normalize(col):
    mean = col.mean()
    std = col.std()
    return (col - mean) / std
    
normalize(weekly_sales)

<FloatingArray>
[-0.35082320772281156,   0.5262348115842176,  -1.2278812270298407,
   1.4032928308912467, -0.35082320772281156]
Length: 5, dtype: Float64

In [17]:
import numpy as np
average_sales = np.mean(sales['weekly_sales'])


normalized_weekly_sales_and_temperature = sales[
    ['weekly_sales', 'temperature_c']].agg([normalize, np.cumsum])
normalized_weekly_sales_and_temperature

C:\Users\mrmdh\AppData\Local\Temp\ipykernel_10200\2105745962.py:6: FutureWarning: The provided callable <function cumsum at 0x000002A24852AD40> is currently using Series.cumsum. In a future version of pandas, the provided callable will be used directly. To keep current behavior pass the string "cumsum" instead.
  ['weekly_sales', 'temperature_c']].agg([normalize, np.cumsum])

      weekly_sales               temperature_c
         normalize        cumsum     normalize         cumsum
0         0.035756  2.492450e+04     -1.008239       5.727778
1        -0.066712  4.675240e+04     -0.773642      13.783333
2         1.105693  1.040108e+05      0.109317      30.600000
3        -0.212771  1.214248e+05      0.684892      53.127778
4        -0.208001  1.389829e+05      1.140648      80.177778
...            ...           ...           ...            ...
10769    -0.759386  2.568930e+08     -0.613511  169405.211111
10770    -0.777421  2.568934e+08      0.020853  169421.150000
10771    -0.774112  2.568938e+08      1.164724  169448.438889
10772    -0.789000  2.568938e+08      0.998994  169474.083333
10773    -0.758725  2.568947e+08      0.656897  169496.333333

[10774 rows x 4 columns]

In [18]:
normalized_weekly_sales_and_temperature.columns

MultiIndex([( 'weekly_sales', 'normalize'),
            ( 'weekly_sales',    'cumsum'),
            ('temperature_c', 'normalize'),
            ('temperature_c',    'cumsum')],
           )

- Pandas_methods_for_categorical_data

In [19]:
sales[['type']].value_counts()

type
A       9872
B        902
Name: count, dtype: int64

In [20]:
sales[['store']].value_counts()

store
13       913
20       910
19       906
10       902
4        901
1        901
27       900
2        897
6        894
31       890
14       885
39       875
Name: count, dtype: int64

In [21]:
sales[['store']].value_counts(ascending=False)

store
13       913
20       910
19       906
10       902
4        901
1        901
27       900
2        897
6        894
31       890
14       885
39       875
Name: count, dtype: int64

Group By 

- Remember that group by logically splits the rows into multiple dataframes
- If we group by type there will two logical dataframes
- df_with_type_A
- df_with_type_B

In [23]:
sales_grouped_type = sales.groupby('type')

sales_grouped_type.head()

,Unnamed: 0,store,type,department,date,weekly_sales,is_holiday,temperature_c,fuel_price_usd_per_l,unemployment
0,0,1,A,1,2010-02-05,24924.50,False,5.727778,0.679451,8.106
1,1,1,A,1,2010-03-05,21827.90,False,8.055556,0.693452,8.106
2,2,1,A,1,2010-04-02,57258.43,False,16.816667,0.718284,7.808
3,3,1,A,1,2010-05-07,17413.94,False,22.527778,0.748928,7.808
4,4,1,A,1,2010-06-04,17558.09,False,27.050000,0.714586,7.808
3593,3593,10,B,1,2010-02-05,40212.84,False,12.411111,0.782478,9.765
3594,3594,10,B,1,2010-03-05,36572.44,False,13.288889,0.760023,9.765
3595,3595,10,B,1,2010-04-02,131853.01,False,17.588889,0.815235,9.524
3596,3596,10,B,1,2010-05-07,29819.93,False,21.700000,0.826066,9.524
3597,3597,10,B,1,2010-06-04,27739.80,False,28.233333,0.776930,9.524

In [24]:
sales_grouped_type['weekly_sales'].sum()

type
A    2.337163e+08
B    2.317840e+07
Name: weekly_sales, dtype: float64

In [25]:
sales_stats = sales_grouped_type["weekly_sales"].agg([min, max, np.mean, np.median])
sales_stats

C:\Users\mrmdh\AppData\Local\Temp\ipykernel_10200\2869706471.py:1: FutureWarning: The provided callable <built-in function min> is currently using SeriesGroupBy.min. In a future version of pandas, the provided callable will be used directly. To keep current behavior pass the string "min" instead.
  sales_stats = sales_grouped_type["weekly_sales"].agg([min, max, np.mean, np.median])
C:\Users\mrmdh\AppData\Local\Temp\ipykernel_10200\2869706471.py:1: FutureWarning: The provided callable <built-in function max> is currently using SeriesGroupBy.max. In a future version of pandas, the provided callable will be used directly. To keep current behavior pass the string "max" instead.
  sales_stats = sales_grouped_type["weekly_sales"].agg([min, max, np.mean, np.median])
C:\Users\mrmdh\AppData\Local\Temp\ipykernel_10200\2869706471.py:1: FutureWarning: The provided callable <function mean at 0x000002A24852BA60> is currently using SeriesGroupBy.mean. In a future version of pandas, the provided callable will be used directly. To keep current behavior pass the string "mean" instead.
  sales_stats = sales_grouped_type["weekly_sales"].agg([min, max, np.mean, np.median])
C:\Users\mrmdh\AppData\Local\Temp\ipykernel_10200\2869706471.py:1: FutureWarning: The provided callable <function median at 0x000002A24867E660> is currently using SeriesGroupBy.median. In a future version of pandas, the provided callable will be used directly. To keep current behavior pass the string "median" instead.
  sales_stats = sales_grouped_type["weekly_sales"].agg([min, max, np.mean, np.median])

         min        max          mean    median
type
A    -1098.0  293966.05  23674.667242  11943.92
B     -798.0  232558.51  25696.678370  13336.08

In [26]:
row = sales.iloc[0,:]
print(row)

Unnamed: 0                       0
store                            1
type                             A
department                       1
date                    2010-02-05
weekly_sales               24924.5
is_holiday                   False
temperature_c             5.727778
fuel_price_usd_per_l      0.679451
unemployment                 8.106
Name: 0, dtype: object

In [27]:
rows = sales.iloc[1:5,3:5]
print(rows)

   department        date
1           1  2010-03-05
2           1  2010-04-02
3           1  2010-05-07
4           1  2010-06-04

Pivot_table

- First_groups_the_dataframe_by_index = type
- df_with_type_A, df_with_type_B
- Apply the methods aggfunc=[min, max, np.mean, np.median] 
- on columns = ['weekly_sales'],

In [28]:
mean_sales_by_type_holiday = sales.pivot_table(
    values=['weekly_sales', 'temperature_c'], 
    index='type', 
    aggfunc=[min, max, np.mean, np.median]
)

mean_sales_by_type_holiday

C:\Users\mrmdh\AppData\Local\Temp\ipykernel_10200\3606495514.py:1: FutureWarning: The provided callable <built-in function min> is currently using DataFrameGroupBy.min. In a future version of pandas, the provided callable will be used directly. To keep current behavior pass the string "min" instead.
  mean_sales_by_type_holiday = sales.pivot_table(
C:\Users\mrmdh\AppData\Local\Temp\ipykernel_10200\3606495514.py:1: FutureWarning: The provided callable <built-in function max> is currently using DataFrameGroupBy.max. In a future version of pandas, the provided callable will be used directly. To keep current behavior pass the string "max" instead.
  mean_sales_by_type_holiday = sales.pivot_table(
C:\Users\mrmdh\AppData\Local\Temp\ipykernel_10200\3606495514.py:1: FutureWarning: The provided callable <function mean at 0x000002A24852BA60> is currently using DataFrameGroupBy.mean. In a future version of pandas, the provided callable will be used directly. To keep current behavior pass the string "mean" instead.
  mean_sales_by_type_holiday = sales.pivot_table(
C:\Users\mrmdh\AppData\Local\Temp\ipykernel_10200\3606495514.py:1: FutureWarning: The provided callable <function median at 0x000002A24867E660> is currently using DataFrameGroupBy.median. In a future version of pandas, the provided callable will be used directly. To keep current behavior pass the string "median" instead.
  mean_sales_by_type_holiday = sales.pivot_table(

               min                        max                       mean  \
     temperature_c weekly_sales temperature_c weekly_sales temperature_c
type
A        -8.366667      -1098.0     33.300000    293966.05     15.231333
B         6.350000       -798.0     33.827778    232558.51     21.211327

                          median
      weekly_sales temperature_c weekly_sales
type
A     23674.667242     16.455556     11943.92
B     25696.678370     21.688889     13336.08

In [29]:
sales.columns

Index(['Unnamed: 0', 'store', 'type', 'department', 'date', 'weekly_sales',
       'is_holiday', 'temperature_c', 'fuel_price_usd_per_l', 'unemployment'],
      dtype='object')